quick_revision_data = {
    "Unit I": [
        "চিকেন নেক → শিলিগুড়ি কৰিড’ৰ",
        "ভূ-কৌশলগত অৱস্থান → জাতীয় নিৰাপত্তা",
        "বহু জাতি + বহু ভাষা → সমাজ-সাংস্কৃতিক বৈচিত্ৰ্য",
        "Inner Line → সীমান্ত নিয়ন্ত্ৰণ"
    ],

    "Unit II": [
        "NRC → নাগৰিকত্ব যাচাই",
        "CAA → নাগৰিকত্ব সংশোধনী আইন",
        "অভিবাসন → জনসংখ্যাগত পৰিবর্তন"
    ],

    "Unit III": [
        "অসম আন্দোলন → বিদেশী সমস্যা",
        "1979 → আন্দোলনৰ আৰম্ভণি",
        "1985 → অসম চুক্তি"
    ],

    "Unit IV": [
        "AGP → আঞ্চলিক ৰাজনৈতিক দল",
        "ULFA → সশস্ত্ৰ বিদ্ৰোহ",
        "Autonomous Council → স্বায়ত্তশাসন"
    ]
}