reference_data = {
    "অসম আন্দোলন": [
        "অসম আন্দোলন আৰু অসম চুক্তি – বিশ্ববিদ্যালয় পাঠ্যক্রম ভিত্তিক আলোচনা",
        "AASU আৰু অসম আন্দোলনৰ ইতিহাস",
        "বিদেশী সমস্যা আৰু অসমৰ ৰাজনীতি"
    ],

    "NRC": [
        "অসমত NRC-ৰ ঐতিহাসিক পটভূমি",
        "নাগৰিকত্ব আৰু NRC বিতর্ক",
        "অসম চুক্তি আৰু নাগৰিকত্ব প্রশ্ন"
    ],

    "AGP": [
        "অসম গণ পৰিষদৰ উত্থান",
        "আঞ্চলিক ৰাজনীতি আৰু AGP",
        "অসম আন্দোলনৰ পৰা AGPলৈ"
    ],

    "ষষ্ঠ তফছিল": [
        "ষষ্ঠ তফছিলৰ সাংবিধানিক তাৎপৰ্য",
        "Autonomous Council আৰু জনজাতীয় শাসন",
        "উত্তৰ-পূৰ্ব ভাৰতত স্বায়ত্তশাসন"
    ],

    "বড়ো আন্দোলন": [
        "বড়ো জাতীয়তাবাদ",
        "BTC আৰু স্বায়ত্তশাসন",
        "বড়ো আন্দোলনৰ ৰাজনৈতিক বিশ্লেষণ"
    ]
}